micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_cacheaxi.c
/**
  ******************************************************************************
  * @file    stm32n6xx_hal_cacheaxi.c
  * @author  MCD Application Team
  * @brief   CACHEAXI HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the CACHEAXI.
  *           + Initialization and Configuration
  *           + Cache coherency command
  *           + Monitoring management
  ******************************************************************************
    * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
 ===============================================================================
                        ##### How to use this driver #####
 ===============================================================================
  [..]
   (#) Configure and enable the MPU to override default config if needed, please refers to
       ARM manual for default memory attribute. Then enable CACHEAXI with HAL_CACHEAXI_Init()
       to cache memories data when accessed by a master peripheral through an AXI interconnect.

    [..]
        (+) Use HAL_CACHEAXI_Invalidate() to invalidate the full cache content:
            (++) Cache content is lost, and reloaded when needed.
            (++) Blocking call until operation is done.
        (+) Use HAL_CACHEAXI_CleanByAddr() to clean cache content for a specific memory range:
            (++) Cache content for specific range is written back to specific memory range.
            (++) Used when buffer is updated by CPU before usage by a peripheral (typically DMA transfer)
            (++) Blocking call until operation is done.
        (+) Use HAL_CACHEAXI_CleanInvalidateByAddr() to clean and invalidate cache content for a specific memory range:
            (++) Cache content for specific range is written back to specific memory range, and reloaded when needed.
            (++) Recommended to use for MPU reprogramming.
            (++) Blocking call until operation is done.

     *** Interrupt mode IO operation ***
     ===================================
    [..]
        (+) Configure the CACHEAXI interrupt priority using HAL_NVIC_SetPriority()
        (+) Enable the CACHEAXI IRQ handler using HAL_NVIC_EnableIRQ()
        (+) Override weak definition for following callbacks (if needed):
            (++)HAL_CACHEAXI_CleanAndInvalidateByAddrCallback()
            (++)HAL_CACHEAXI_InvalidateCompleteCallback()
            (++)HAL_CACHEAXI_CleanByAddrCallback()
            (++)HAL_CACHEAXI_ErrorCallback()
        (+) Use HAL_CACHEAXI_<COMMAND>_IT() to start a CACHEAXI operation with IT enabled.
        (+) Use HAL_CACHEAXI_IRQHandler() called under CACHEAXIx_IRQHandler() Interrupt subroutine

    [..]  Use HAL_CACHEAXI_GetState() function to return the CACHEAXI state and HAL_CACHEAXI_GetError()
          in case of error detection.

     *** CACHEAXI HAL driver macros list ***
     =============================================
     [..]
       Below the list of macros defined in the CACHEAXI HAL driver.

      (+) __HAL_CACHEAXI_ENABLE_IT    : Enable CACHEAXI interrupts.
      (+) __HAL_CACHEAXI_DISABLE_IT   : Disable CACHEAXI interrupts.
      (+) __HAL_CACHEAXI_GET_IT_SOURCE: Check whether the specified CACHEAXI interrupt source is enabled or not.
      (+) __HAL_CACHEAXI_GET_FLAG     : Check whether the selected CACHEAXI flag is set or not.
      (+) __HAL_CACHEAXI_CLEAR_FLAG   : Clear the selected CACHEAXI flags.

     [..]
      (@) You can refer to the header file of the CACHEAXI HAL driver for more useful macros.

    [..]

  @endverbatim
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32n6xx_hal.h"

/** @addtogroup STM32N6xx_HAL_Driver
  * @{
  */

#if defined (CACHEAXI)
/** @defgroup CACHEAXI CACHEAXI
  * @brief HAL CACHEAXI module driver
  * @{
  */

#ifdef HAL_CACHEAXI_MODULE_ENABLED

/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/** @defgroup CACHEAXI_Private_Macros CACHEAXI Private Macros
  * @{
  */
#define IS_CACHEAXI_REGION_SIZE(__SIZE__)                ((__SIZE__) > 0U)

#define IS_CACHEAXI_MONITOR_TYPE(__TYPE__)               (((__TYPE__) & ~CACHEAXI_MONITOR_ALL) == 0U)

#define IS_CACHEAXI_SINGLE_MONITOR_TYPE(__TYPE__)      (((__TYPE__) == CACHEAXI_MONITOR_READ_HIT)       || \
                                                        ((__TYPE__) == CACHEAXI_MONITOR_READ_MISS)      || \
                                                        ((__TYPE__) == CACHEAXI_MONITOR_WRITE_HIT)      || \
                                                        ((__TYPE__) == CACHEAXI_MONITOR_WRITE_MISS)     || \
                                                        ((__TYPE__) == CACHEAXI_MONITOR_READALLOC_MISS) || \
                                                        ((__TYPE__) == CACHEAXI_MONITOR_WRITEALLOC_MISS)|| \
                                                        ((__TYPE__) == CACHEAXI_MONITOR_WRITETHROUGH)   || \
                                                        ((__TYPE__) == CACHEAXI_MONITOR_EVICTION))

/**
  * @}
  */

/* Private typedef -----------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @addtogroup CACHEAXI_Private_Constants CACHEAXI Private Constants
  * @{
  */
#define CACHEAXI_COMMAND_TIMEOUT_VALUE           200U    /* 200ms*/
#define CACHEAXI_ENABLE_TIMEOUT_VALUE            1U      /* 1ms  */
#define CACHEAXI_DISABLE_TIMEOUT_VALUE           1U      /* 1ms  */

