micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_cacheaxi.c
#define CACHEAXI_COMMAND_CLEAN                   CACHEAXI_CR2_CACHECMD_0
#define CACHEAXI_COMMAND_CLEAN_INVALIDATE        (CACHEAXI_CR2_CACHECMD_0|CACHEAXI_CR2_CACHECMD_1)

#define CACHEAXI_POLLING_MODE                    0U
#define CACHEAXI_IT_MODE                         1U

/**
  * @}
  */

/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
static HAL_StatusTypeDef CACHEAXI_CommandByAddr(CACHEAXI_HandleTypeDef *hcacheaxi, uint32_t Command,
                                                const uint32_t *pAddr, uint32_t dSize, uint32_t mode);

/* Exported functions --------------------------------------------------------*/
/** @addtogroup CACHEAXI_Exported_Functions CACHEAXI Exported Functions
  * @{
  */

/** @addtogroup CACHEAXI_Exported_Functions_Group1
  *
@verbatim
 ===============================================================================
              ##### Initialization and de-initialization functions #####
 ===============================================================================
    [..]  This subsection provides a set of functions allowing to initialize and
          deinitialize the CACHEAXIx peripheral:

      (+) User must implement HAL_CACHEAXI_MspInit() function in which he configures
          all related peripherals resources (CLOCK, MPU, IT and NVIC ).

      (+) Call the function HAL_CACHEAXI_Init() to initialize the CACHEAXIx handle and
          enable the CACHEAXI

      (+) Call the function HAL_CACHEAXI_DeInit() to restore the reset configuration
          of the selected CACHEAXIx peripheral.

@endverbatim
  * @{
  */

/**
  * @brief  Initializes the CACHEAXI handle and enables the CACHEAXI.
  * @param  hcacheaxi Pointer to a CACHEAXI_HandleTypeDef structure that contains
  *                   the configuration information for the specified CACHEAXI.
  * @retval HAL status
  * @note   In case HAL_CACHEAXI_Init() returns HAL_BUSY because an invalidation
  *         procedure is ongoing, the application should call again HAL_CACHEAXI_Init()
  *         until it returns HAL_OK to have the CACHEAXI enabled
  */
HAL_StatusTypeDef  HAL_CACHEAXI_Init(CACHEAXI_HandleTypeDef *hcacheaxi)
{
  HAL_StatusTypeDef status;

  /* Check the CACHEAXI handle allocation */
  if (hcacheaxi == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_CACHEAXI_ALL_INSTANCE(hcacheaxi->Instance));

  if (hcacheaxi->State == HAL_CACHEAXI_STATE_RESET)
  {
#if (USE_HAL_CACHEAXI_REGISTER_CALLBACKS == 1)
    /* Init the CACHEAXI Callback settings with legacy weak */
    hcacheaxi->ErrorCallback                      = HAL_CACHEAXI_ErrorCallback;
    hcacheaxi->CleanByAddrCallback                = HAL_CACHEAXI_CleanByAddrCallback;
    hcacheaxi->InvalidateCompleteCallback         = HAL_CACHEAXI_InvalidateCompleteCallback;
    hcacheaxi->CleanAndInvalidateByAddrCallback   = HAL_CACHEAXI_CleanAndInvalidateByAddrCallback;

    if (hcacheaxi->MspInitCallback == NULL)
    {
      hcacheaxi->MspInitCallback = HAL_CACHEAXI_MspInit;
    }

    /* Init the low level hardware */
    hcacheaxi->MspInitCallback(hcacheaxi);
#else
    /* Init the low level hardware */
    HAL_CACHEAXI_MspInit(hcacheaxi);
#endif /* USE_HAL_CACHEAXI_REGISTER_CALLBACKS */
  }

  /* Init the error code */
  hcacheaxi->ErrorCode = HAL_CACHEAXI_ERROR_NONE;

  /* Init the CACHEAXI handle state */
  hcacheaxi->State = HAL_CACHEAXI_STATE_READY;

  /* Enable the selected CACHEAXI peripheral */
  status = HAL_CACHEAXI_Enable(hcacheaxi);

  return status;
}

/**
  * @brief  DeInitialize the Data cache.
  * @param  hcacheaxi Pointer to a CACHEAXI_HandleTypeDef structure that contains
  *                   the configuration information for the specified CACHEAXIx peripheral.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CACHEAXI_DeInit(CACHEAXI_HandleTypeDef *hcacheaxi)
{
  HAL_StatusTypeDef status;

  /* Check the cacheaxi handle allocation */
  if (hcacheaxi == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_CACHEAXI_ALL_INSTANCE(hcacheaxi->Instance));

  /* Update the error code */
  hcacheaxi->ErrorCode = HAL_CACHEAXI_ERROR_NONE;

  /* Return to the reset state */
  hcacheaxi->State = HAL_CACHEAXI_STATE_RESET;

  /* Disable cache */
  status = HAL_CACHEAXI_Disable(hcacheaxi);

  /* reset monitor values */
  (void)HAL_CACHEAXI_Monitor_Reset(hcacheaxi, CACHEAXI_MONITOR_ALL);

  /* Reset all remaining bit */
  WRITE_REG(hcacheaxi->Instance->CR1, 0U);
  WRITE_REG(hcacheaxi->Instance->CR2, 0U);
  WRITE_REG(hcacheaxi->Instance->CMDRSADDRR, 0U);
  WRITE_REG(hcacheaxi->Instance->CMDREADDRR, 0U);
  WRITE_REG(hcacheaxi->Instance->FCR, 0U);
  WRITE_REG(hcacheaxi->Instance->IER, 0U);

#if (USE_HAL_CACHEAXI_REGISTER_CALLBACKS == 1)
  if (hcacheaxi->MspDeInitCallback == NULL)
  {
    hcacheaxi->MspDeInitCallback = HAL_CACHEAXI_MspDeInit;
  }

  /* DeInitialize the low level hardware */
  hcacheaxi->MspDeInitCallback(hcacheaxi);
#else
  /* DeInitialize the low level hardware */
  HAL_CACHEAXI_MspDeInit(hcacheaxi);
#endif /* USE_HAL_CACHEAXI_REGISTER_CALLBACKS */

  return status;
}

/**
  * @brief Initialize the CACHEAXI MSP.
  * @param  hcacheaxi Pointer to a CACHEAXI_HandleTypeDef structure that contains
  *                   the configuration information for the specified CACHEAXIx peripheral.
  * @retval None
  */
__weak void HAL_CACHEAXI_MspInit(CACHEAXI_HandleTypeDef *hcacheaxi)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hcacheaxi);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_CACHEAXI_MspInit can be implemented in the user file
   */
}

/**
  * @brief DeInitialize the CACHEAXI MSP.
  * @param  hcacheaxi Pointer to a CACHEAXI_HandleTypeDef structure that contains
  *                 the configuration information for the specified CACHEAXIx peripheral.
  * @retval None
  */
__weak void HAL_CACHEAXI_MspDeInit(CACHEAXI_HandleTypeDef *hcacheaxi)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hcacheaxi);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_CACHEAXI_MspDeInit can be implemented in the user file
   */
}
/**
  * @}
  */

/** @addtogroup CACHEAXI_Exported_Functions_Group2
  *
@verbatim
  ==============================================================================
             ##### IO operation functions #####
  ==============================================================================
    [..]  This section provides functions allowing to:
      (+) Enable CACHEAXI.
      (+) Disable CACHEAXI.
      (+) Invalidate the CACHEAXI.
      (+) Invalidate the CACHEAXI with interrupt.
      (+) Clean the CACHEAXI by Addr.
      (+) Clean and Invalidate the CACHEAXI by Addr.
      (+) Clean the CACHEAXI by Addr with interrupt.
      (+) Clean and Invalidate the CACHEAXI by Addr with interrupt.
      (+) Start the CACHEAXI performance monitoring.
      (+) Stop the CACHEAXI performance monitoring.
      (+) Reset the CACHEAXI performance monitoring values.
      (+) Get the CACHEAXI performance Read Hit monitoring value.
      (+) Get the CACHEAXI performance Read Miss monitoring value.
      (+) Get the CACHEAXI performance Write Hit monitoring value.
      (+) Get the CACHEAXI performance Write Miss monitoring value.
      (+) Get the CACHEAXI performance Read Allocation Miss monitoring value.
      (+) Get the CACHEAXI performance Write Allocation Miss monitoring value.
      (+) Get the CACHEAXI performance Write Through monitoring value.
      (+) Get the CACHEAXI performance Eviction monitoring value.
@endverbatim
  * @{
  */

/**
  * @brief  Enable the Data cache.
  * @param  hcacheaxi Pointer to a CACHEAXI_HandleTypeDef structure that contains
  *                   the configuration information for the specified CACHEAXIx peripheral.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CACHEAXI_Enable(CACHEAXI_HandleTypeDef *hcacheaxi)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t tickstart;

  /* Check the cacheaxi handle allocation */
  if (hcacheaxi == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_CACHEAXI_ALL_INSTANCE(hcacheaxi->Instance));

  /* Check if ongoing full invalidation operation */
  if (READ_BIT(hcacheaxi->Instance->SR, CACHEAXI_SR_BUSYF) != 0U)
  {
    /* Get tick */
    tickstart = HAL_GetTick();

