micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_cacheaxi.c
  return status;
}

/**
  * @brief  Invalidate the Data cache with interrupt.
  * @param  hcacheaxi Pointer to a CACHEAXI_HandleTypeDef structure that contains
  *                   the configuration information for the specified CACHEAXIx peripheral.
  * @note   This function launches maintenance operation and returns immediately.
  *         User application shall resort to interrupt generation to check
  *         the end of operation.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CACHEAXI_Invalidate_IT(CACHEAXI_HandleTypeDef *hcacheaxi)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check the cacheaxi handle allocation */
  if (hcacheaxi == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_CACHEAXI_ALL_INSTANCE(hcacheaxi->Instance));

  /* Check no ongoing operation */
  if (READ_BIT(hcacheaxi->Instance->SR, (CACHEAXI_SR_BUSYF | CACHEAXI_SR_BUSYCMDF)) != 0U)
  {
    /* Return busy status */
    status =  HAL_BUSY;
  }
  else
  {
    /* Update the error code */
    hcacheaxi->ErrorCode = HAL_CACHEAXI_ERROR_NONE;

    /* Change CACHEAXI Handle state */
    hcacheaxi->State = HAL_CACHEAXI_STATE_READY;

    /* Make sure BSYENDF is reset */
    WRITE_REG(hcacheaxi->Instance->FCR, (CACHEAXI_FCR_CBSYENDF | CACHEAXI_FCR_CCMDENDF));

    /* Set no operation on address range for callback under interrupt */
    MODIFY_REG(hcacheaxi->Instance->CR2, CACHEAXI_CR2_CACHECMD, 0U);

    /* Enable end of cache invalidation interrupt */
    SET_BIT(hcacheaxi->Instance->IER, CACHEAXI_IER_BSYENDIE);

    /* Launch cache invalidation */
    SET_BIT(hcacheaxi->Instance->CR1, CACHEAXI_CR1_CACHEINV);
  }

  return status;
}

/**
  * @brief  Clean the Data cache by Addr with interrupt.
  * @param  hcacheaxi Pointer to a CACHEAXI_HandleTypeDef structure that contains
  *                   the configuration information for the specified CACHEAXIx peripheral.
  * @param  pAddr Start address of the region to be Cleaned
  * @param  dSize Size of the region to be Cleaned
  * @note   This function launches maintenance operation and returns immediately.
  *         User application shall resort to interrupt generation to check
  *         the end of operation.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CACHEAXI_CleanByAddr_IT(CACHEAXI_HandleTypeDef *hcacheaxi, const uint32_t *const pAddr,
                                              uint32_t dSize)
{
  HAL_StatusTypeDef status;

  /* Check the cacheaxi handle allocation */
  if (hcacheaxi == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_CACHEAXI_ALL_INSTANCE(hcacheaxi->Instance));
  assert_param(IS_CACHEAXI_REGION_SIZE(dSize));

  status = CACHEAXI_CommandByAddr(hcacheaxi, CACHEAXI_COMMAND_CLEAN, pAddr, dSize, CACHEAXI_IT_MODE);

  return status;
}

/**
  * @brief  Clean and Invalidate the Data cache by Addr with interrupt.
  * @param  hcacheaxi Pointer to a CACHEAXI_HandleTypeDef structure that contains
  *                   the configuration information for the specified CACHEAXIx peripheral.
  * @param  pAddr Start address of the region to be Cleaned and Invalidated
  * @param  dSize Size of the region to be Cleaned and Invalidated
  * @note   This function launches maintenance operation and returns immediately.
  *         User application shall resort to interrupt generation to check
  *         the end of operation.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CACHEAXI_CleanInvalidByAddr_IT(CACHEAXI_HandleTypeDef *hcacheaxi, const uint32_t *const pAddr,
                                                     uint32_t dSize)
{
  HAL_StatusTypeDef status;

  /* Check the cacheaxi handle allocation */
  if (hcacheaxi == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_CACHEAXI_ALL_INSTANCE(hcacheaxi->Instance));
  assert_param(IS_CACHEAXI_REGION_SIZE(dSize));

  status = CACHEAXI_CommandByAddr(hcacheaxi, CACHEAXI_COMMAND_CLEAN_INVALIDATE, pAddr, dSize, CACHEAXI_IT_MODE);

  return status;
}

/**
  * @brief  Start the CACHEAXI performance monitoring.
  * @param  hcacheaxi Pointer to a CACHEAXI_HandleTypeDef structure that contains
  *                   the configuration information for the specified CACHEAXIx peripheral.
  * @param  MonitorType Monitoring type
  *         This parameter can be a combination of the following values:
  *            @arg CACHEAXI_MONITOR_READ_HIT
  *            @arg CACHEAXI_MONITOR_READ_MISS
  *            @arg CACHEAXI_MONITOR_WRITE_HIT
  *            @arg CACHEAXI_MONITOR_WRITE_MISS
  *            @arg CACHEAXI_MONITOR_READALLOC_MISS
  *            @arg CACHEAXI_MONITOR_WRITEALLOC_MISS
  *            @arg CACHEAXI_MONITOR_WRITETHROUGH
  *            @arg CACHEAXI_MONITOR_EVICTION
  *            @arg CACHEAXI_MONITOR_ALL
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CACHEAXI_Monitor_Start(CACHEAXI_HandleTypeDef *hcacheaxi, uint32_t MonitorType)
{
  /* Check the cacheaxi handle allocation */
  if (hcacheaxi == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_CACHEAXI_ALL_INSTANCE(hcacheaxi->Instance));
  assert_param(IS_CACHEAXI_MONITOR_TYPE(MonitorType));

  SET_BIT(hcacheaxi->Instance->CR1, MonitorType);

  return HAL_OK;
}

/**
  * @brief  Stop the CACHEAXI performance monitoring.
  * @param  hcacheaxi Pointer to a CACHEAXI_HandleTypeDef structure that contains
  *                   the configuration information for the specified CACHEAXIx peripheral.
  * @note   Stopping the monitoring does not reset the values.
  * @param  MonitorType Monitoring type
  *         This parameter can be a combination of the following values:
  *            @arg CACHEAXI_MONITOR_READ_HIT
  *            @arg CACHEAXI_MONITOR_READ_MISS
  *            @arg CACHEAXI_MONITOR_WRITE_HIT
  *            @arg CACHEAXI_MONITOR_WRITE_MISS
  *            @arg CACHEAXI_MONITOR_READALLOC_MISS
  *            @arg CACHEAXI_MONITOR_WRITEALLOC_MISS
  *            @arg CACHEAXI_MONITOR_WRITETHROUGH
  *            @arg CACHEAXI_MONITOR_EVICTION
  *            @arg CACHEAXI_MONITOR_ALL
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CACHEAXI_Monitor_Stop(CACHEAXI_HandleTypeDef *hcacheaxi, uint32_t MonitorType)
{
  /* Check the cacheaxi handle allocation */
  if (hcacheaxi == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_CACHEAXI_ALL_INSTANCE(hcacheaxi->Instance));
  assert_param(IS_CACHEAXI_MONITOR_TYPE(MonitorType));

