micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_cacheaxi.c
  CLEAR_BIT(hcacheaxi->Instance->CR1, MonitorType);

  return HAL_OK;
}

/**
  * @brief  Reset the CACHEAXI performance monitoring values.
  * @param  hcacheaxi Pointer to a CACHEAXI_HandleTypeDef structure that contains
  *                   the configuration information for the specified CACHEAXIx peripheral.
  * @param  MonitorType Monitoring type
  *         This parameter can be a combination of the following values:
  *            @arg CACHEAXI_MONITOR_READ_HIT
  *            @arg CACHEAXI_MONITOR_READ_MISS
  *            @arg CACHEAXI_MONITOR_WRITE_HIT
  *            @arg CACHEAXI_MONITOR_WRITE_MISS
  *            @arg CACHEAXI_MONITOR_READALLOC_MISS
  *            @arg CACHEAXI_MONITOR_WRITEALLOC_MISS
  *            @arg CACHEAXI_MONITOR_WRITETHROUGH
  *            @arg CACHEAXI_MONITOR_EVICTION
  *            @arg CACHEAXI_MONITOR_ALL
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CACHEAXI_Monitor_Reset(CACHEAXI_HandleTypeDef *hcacheaxi, uint32_t MonitorType)
{
  /* Check the cacheaxi handle allocation */
  if (hcacheaxi == NULL)
  {
    return HAL_ERROR;
  }

  /* Check the parameters */
  assert_param(IS_CACHEAXI_ALL_INSTANCE(hcacheaxi->Instance));
  assert_param(IS_CACHEAXI_MONITOR_TYPE(MonitorType));

  /* Force/Release reset */
  SET_BIT(hcacheaxi->Instance->CR1, (MonitorType << 2U));
  CLEAR_BIT(hcacheaxi->Instance->CR1, (MonitorType << 2U));

  return HAL_OK;
}

/**
  * @brief  Get the CACHEAXI performance Read Hit monitoring value.
  * @param  hcacheaxi Pointer to a CACHEAXI_HandleTypeDef structure that contains
  *                   the configuration information for the specified CACHEAXIx peripheral.
  * @note   Upon reaching the 32-bit maximum value, monitor does not wrap.
  * @retval Read Hit monitoring value
  */
uint32_t HAL_CACHEAXI_Monitor_GetReadHitValue(const CACHEAXI_HandleTypeDef *hcacheaxi)
{
  /* Check the parameters */
  assert_param(IS_CACHEAXI_ALL_INSTANCE(hcacheaxi->Instance));

  /*return the Read Hit monitor value*/
  return hcacheaxi->Instance->RHMONR;
}

/**
  * @brief  Get the CACHEAXI performance Read Miss monitoring value.
  * @param  hcacheaxi Pointer to a CACHEAXI_HandleTypeDef structure that contains
  *                   the configuration information for the specified CACHEAXIx peripheral.
  * @note   Upon reaching the 16-bit maximum value, monitor does not wrap.
  * @retval Read Miss monitoring value
  */
uint32_t HAL_CACHEAXI_Monitor_GetReadMissValue(const CACHEAXI_HandleTypeDef *hcacheaxi)
{
  /* Check the parameters */
  assert_param(IS_CACHEAXI_ALL_INSTANCE(hcacheaxi->Instance));

  /*return the Read Miss monitor value*/
  return hcacheaxi->Instance->RMMONR;
}

/**
  * @brief  Get the CACHEAXI performance Write Hit monitoring value.
  * @param  hcacheaxi Pointer to a CACHEAXI_HandleTypeDef structure that contains
  *                   the configuration information for the specified CACHEAXIx peripheral.
  * @note   Upon reaching the 32-bit maximum value, monitor does not wrap.
  * @retval Write Hit monitoring value
  */
uint32_t HAL_CACHEAXI_Monitor_GetWriteHitValue(const CACHEAXI_HandleTypeDef *hcacheaxi)
{
  /* Check the parameters */
  assert_param(IS_CACHEAXI_ALL_INSTANCE(hcacheaxi->Instance));

  /*return the Write Hit monitor value*/
  return hcacheaxi->Instance->WHMONR;
}

/**
  * @brief  Get the CACHEAXI performance Write Miss monitoring value.
  * @param  hcacheaxi Pointer to a CACHEAXI_HandleTypeDef structure that contains
  *                   the configuration information for the specified CACHEAXIx peripheral.
  * @note   Upon reaching the 16-bit maximum value, monitor does not wrap.
  * @retval Write Miss monitoring value
  */
uint32_t HAL_CACHEAXI_Monitor_GetWriteMissValue(const CACHEAXI_HandleTypeDef *hcacheaxi)
{
  /* Check the parameters */
  assert_param(IS_CACHEAXI_ALL_INSTANCE(hcacheaxi->Instance));

  /*return the Write Miss monitor value*/
  return hcacheaxi->Instance->WMMONR;
}

/**
  * @brief  Get the CACHEAXI performance Read-allocate Miss monitoring value.
  * @param  hcacheaxi Pointer to a CACHEAXI_HandleTypeDef structure that contains
  *                   the configuration information for the specified CACHEAXIx peripheral.
  * @note   Upon reaching the 16-bit maximum value, monitor does not wrap.
  * @retval Read-allocate Miss monitoring value
  */
uint32_t HAL_CACHEAXI_Monitor_GetReadAllocMissValue(const CACHEAXI_HandleTypeDef *hcacheaxi)
{
  /* Check the parameters */
  assert_param(IS_CACHEAXI_ALL_INSTANCE(hcacheaxi->Instance));

  /*return the read-allocate Miss monitor value*/
  return hcacheaxi->Instance->RAMMONR;
}

/**
  * @brief  Get the CACHEAXI performance Write-allocate Miss monitoring value.
  * @param  hcacheaxi Pointer to a CACHEAXI_HandleTypeDef structure that contains
  *                   the configuration information for the specified CACHEAXIx peripheral.
  * @note   Upon reaching the 16-bit maximum value, monitor does not wrap.
  * @retval Write-allocate Miss monitoring value
  */
uint32_t HAL_CACHEAXI_Monitor_GetWriteAllocMissValue(const CACHEAXI_HandleTypeDef *hcacheaxi)
{
  /* Check the parameters */
  assert_param(IS_CACHEAXI_ALL_INSTANCE(hcacheaxi->Instance));

  /*return the write-allocate Miss monitor value*/
  return hcacheaxi->Instance->WAMMONR;
}

/**
  * @brief  Get the CACHEAXI performance Write-through monitoring value.
  * @param  hcacheaxi Pointer to a CACHEAXI_HandleTypeDef structure that contains
  *                   the configuration information for the specified CACHEAXIx peripheral.
  * @note   Upon reaching the 16-bit maximum value, monitor does not wrap.
  * @retval Write-through monitoring value
  */
uint32_t HAL_CACHEAXI_Monitor_GetWriteThroughValue(const CACHEAXI_HandleTypeDef *hcacheaxi)
{
  /* Check the parameters */
  assert_param(IS_CACHEAXI_ALL_INSTANCE(hcacheaxi->Instance));

  /*return the Write-through monitor value*/
  return hcacheaxi->Instance->WTMONR;
}

/**
  * @brief  Get the CACHEAXI performance Eviction Miss monitoring value.
  * @param  hcacheaxi Pointer to a CACHEAXI_HandleTypeDef structure that contains
  *                   the configuration information for the specified CACHEAXIx peripheral.
  * @note   Upon reaching the 16-bit maximum value, monitor does not wrap.
  * @retval Eviction monitoring value
  */
uint32_t HAL_CACHEAXI_Monitor_GetEvictionValue(const CACHEAXI_HandleTypeDef *hcacheaxi)
{
  /* Check the parameters */
  assert_param(IS_CACHEAXI_ALL_INSTANCE(hcacheaxi->Instance));

  /*return the Eviction  monitor value*/
  return hcacheaxi->Instance->EVIMONR;
}

/**
  * @brief Handle the CACHEAXI interrupt request.
  * @param  hcacheaxi Pointer to a CACHEAXI_HandleTypeDef structure that contains
  *                   the configuration information for the specified CACHEAXIx peripheral.
  * @note  This API should be called under the CACHEAXIx_IRQHandler().
  * @retval None
  */
void HAL_CACHEAXI_IRQHandler(CACHEAXI_HandleTypeDef *hcacheaxi)
{
  uint32_t itflags;
  uint32_t itsources;

  /* Check the parameters */
  assert_param(IS_CACHEAXI_ALL_INSTANCE(hcacheaxi->Instance));

  /* Get current interrupt flags and interrupt sources value */
  itflags   = READ_REG(hcacheaxi->Instance->SR);
  itsources = READ_REG(hcacheaxi->Instance->IER);

  /* Check Data cache Error interrupt flag  */
  if (((itflags & itsources) & CACHEAXI_FLAG_ERROR) != 0U)
  {
    /* Clear CACHEAXI error pending flag */
    __HAL_CACHEAXI_CLEAR_FLAG(hcacheaxi, CACHEAXI_FLAG_ERROR);

    /* Update data cache error code */
    hcacheaxi->ErrorCode = HAL_CACHEAXI_ERROR_EVICTION_CLEAN;

