micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_cacheaxi.c
#if (USE_HAL_CACHEAXI_REGISTER_CALLBACKS == 1)
    /* Data cache error interrupt user callback */
    hcacheaxi->ErrorCallback(hcacheaxi);
#else
    /* Data cache error interrupt user callback */
    HAL_CACHEAXI_ErrorCallback(hcacheaxi);
#endif /* USE_HAL_CACHEAXI_REGISTER_CALLBACKS */
  }
  /* Check for end of full invalidate operation */
  if (READ_BIT(hcacheaxi->Instance->CR2, CACHEAXI_CR2_CACHECMD) == 0U)
  {
    /* Clear CACHEAXI busyend pending flag */
    __HAL_CACHEAXI_CLEAR_FLAG(hcacheaxi, CACHEAXI_FLAG_BUSYEND);

#if (USE_HAL_CACHEAXI_REGISTER_CALLBACKS == 1)
    /* Data cache invalidate complete interrupt user callback */
    hcacheaxi->InvalidateCompleteCallback(hcacheaxi);
#else
    /* Data cache invalidate complete interrupt user callback */
    HAL_CACHEAXI_InvalidateCompleteCallback(hcacheaxi);
#endif /* USE_HAL_CACHEAXI_REGISTER_CALLBACKS */
  }

  /* Check for end of clean and invalidate by address operation */
  else if (READ_BIT(hcacheaxi->Instance->CR1, CACHEAXI_COMMAND_CLEAN_INVALIDATE) == \
           (CACHEAXI_COMMAND_CLEAN_INVALIDATE))
  {
    /* Clear CACHEAXI cmdend pending flag */
    __HAL_CACHEAXI_CLEAR_FLAG(hcacheaxi, CACHEAXI_FLAG_CMDEND);

#if (USE_HAL_CACHEAXI_REGISTER_CALLBACKS == 1)
    /* Data cache clean and invalidate range cmdend interrupt user callback */
    hcacheaxi->CleanAndInvalidateByAddrCallback(hcacheaxi);
#else
    /* Data cache clean and invalidate range cmdend interrupt user callback */
    HAL_CACHEAXI_CleanAndInvalidateByAddrCallback(hcacheaxi);
#endif /* USE_HAL_CACHEAXI_REGISTER_CALLBACKS */
  }

  /* Check for end of clean by address operation */
  else
  {
    /* Clear CACHEAXI cmdend pending flag */
    __HAL_CACHEAXI_CLEAR_FLAG(hcacheaxi, CACHEAXI_FLAG_CMDEND);

#if (USE_HAL_CACHEAXI_REGISTER_CALLBACKS == 1)
    /* Data cache clean range cmdend interrupt user callback */
    hcacheaxi->CleanByAddrCallback(hcacheaxi);
#else
    /* Data cache clean range cmdend interrupt user callback */
    HAL_CACHEAXI_CleanByAddrCallback(hcacheaxi);
#endif /* USE_HAL_CACHEAXI_REGISTER_CALLBACKS */
  }
}

#if (USE_HAL_CACHEAXI_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register a User CACHEAXI Callback
  *         To be used instead of the weak predefined callback
  * @param  hcacheaxi Pointer to a CACHEAXI_HandleTypeDef structure that contains
  *                   the configuration information for the specified CACHEAXIx peripheral.
  * @param  CallbackID ID of the callback to be registered
  *         This parameter can be one of the following values:
  *          @arg @ref HAL_CACHEAXI_CLEAN_BY_ADDRESS_CB_ID Clean By Addr callback ID
  *          @arg @ref HAL_CACHEAXI_INVALIDATE_BY_ADDRESS_CB_ID Invalidate By Addr callback ID
  *          @arg @ref HAL_CACHEAXI_CLEAN_AND_INVALIDATE_BY_ADDRESS_CB_ID Clean and Invalidate By Addr callback ID
  *          @arg @ref HAL_CACHEAXI_INVALIDATE_COMPLETE_CB_ID Invalidate Complete ID
  *          @arg @ref HAL_CACHEAXI_ERROR_CB_ID  Error callback ID
  *          @arg @ref HAL_CACHEAXI_MSPINIT_CB_ID MspInit callback ID
  *          @arg @ref HAL_CACHEAXI_MSPDEINIT_CB_ID MspDeInit callback ID
  * @param  pCallback pointer to the Callback function
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CACHEAXI_RegisterCallback(CACHEAXI_HandleTypeDef *hcacheaxi,
                                                HAL_CACHEAXI_CallbackIDTypeDef CallbackID,
                                                pCACHEAXI_CallbackTypeDef pCallback)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check the cacheaxi handle allocation */
  if (hcacheaxi == NULL)
  {
    return HAL_ERROR;
  }

  if (pCallback == NULL)
  {
    /* Update the error code */
    hcacheaxi->ErrorCode |= HAL_CACHEAXI_ERROR_INVALID_CALLBACK;

    /* Return error status */
    return HAL_ERROR;
  }

  if (hcacheaxi->State == HAL_CACHEAXI_STATE_READY)
  {
    switch (CallbackID)
    {
      case HAL_CACHEAXI_CLEAN_BY_ADDRESS_CB_ID :
        hcacheaxi->CleanByAddrCallback = pCallback;
        break;

      case HAL_CACHEAXI_CLEAN_AND_INVALIDATE_BY_ADDRESS_CB_ID :
        hcacheaxi->CleanAndInvalidateByAddrCallback = pCallback;
        break;

      case HAL_CACHEAXI_INVALIDATE_COMPLETE_CB_ID :
        hcacheaxi->InvalidateCompleteCallback = pCallback;
        break;

      case HAL_CACHEAXI_ERROR_CB_ID :
        hcacheaxi->ErrorCallback = pCallback;
        break;

      case HAL_CACHEAXI_MSPINIT_CB_ID :
        hcacheaxi->MspInitCallback = pCallback;
        break;

      case HAL_CACHEAXI_MSPDEINIT_CB_ID :
        hcacheaxi->MspDeInitCallback = pCallback;
        break;

      default :
        /* Update the error code */
        hcacheaxi->ErrorCode |= HAL_CACHEAXI_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  HAL_ERROR;
        break;
    }
  }
  else if (hcacheaxi->State == HAL_CACHEAXI_STATE_RESET)
  {
    switch (CallbackID)
    {
      case HAL_CACHEAXI_MSPINIT_CB_ID :
        hcacheaxi->MspInitCallback = pCallback;
        break;

      case HAL_CACHEAXI_MSPDEINIT_CB_ID :
        hcacheaxi->MspDeInitCallback = pCallback;
        break;

      default :
        /* Update the error code */
        hcacheaxi->ErrorCode |= HAL_CACHEAXI_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  HAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    hcacheaxi->ErrorCode |= HAL_CACHEAXI_ERROR_INVALID_CALLBACK;

    /* Return error status */
    status =  HAL_ERROR;
  }

  return status;
}

/**
  * @brief  Unregister an CACHEAXI Callback
  *         CACHEAXI callback is redirected to the weak predefined callback
  * @param  hcacheaxi Pointer to a CACHEAXI_HandleTypeDef structure that contains
  *                   the configuration information for the specified CACHEAXIx peripheral.
  * @param  CallbackID ID of the callback to be unregistered
  *         This parameter can be one of the following values:
  *          @arg @ref HAL_CACHEAXI_CLEAN_BY_ADDRESS_CB_ID Clean By Addr callback ID
  *          @arg @ref HAL_CACHEAXI_CLEAN_AND_INVALIDATE_BY_ADDRESS_CB_ID Clean and Invalidate By Addr callback ID
  *          @arg @ref HAL_CACHEAXI_INVALIDATE_COMPLETE_CB_ID Invalidate Complete callback ID
  *          @arg @ref HAL_CACHEAXI_ERROR_CB_ID  Error callback ID
  *          @arg @ref HAL_CACHEAXI_MSPINIT_CB_ID MspInit callback ID
  *          @arg @ref HAL_CACHEAXI_MSPDEINIT_CB_ID MspDeInit callback ID
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_CACHEAXI_UnRegisterCallback(CACHEAXI_HandleTypeDef *hcacheaxi,
                                                  HAL_CACHEAXI_CallbackIDTypeDef CallbackID)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check the cacheaxi handle allocation */
  if (hcacheaxi == NULL)
  {
    return HAL_ERROR;
  }

