micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_hal_cacheaxi.c
  if (hcacheaxi->State == HAL_CACHEAXI_STATE_READY)
  {
    switch (CallbackID)
    {
      case HAL_CACHEAXI_CLEAN_BY_ADDRESS_CB_ID :
        /* Legacy weak Clean By Addr Callback */
        hcacheaxi->CleanByAddrCallback = HAL_CACHEAXI_CleanByAddrCallback;
        break;

      case HAL_CACHEAXI_CLEAN_AND_INVALIDATE_BY_ADDRESS_CB_ID :
        /* Legacy weak Clean and Invalidate By Addr Callback */
        hcacheaxi->CleanAndInvalidateByAddrCallback = HAL_CACHEAXI_CleanAndInvalidateByAddrCallback;
        break;

      case HAL_CACHEAXI_INVALIDATE_COMPLETE_CB_ID :
        /* Legacy weak Invalidate Complete Callback */
        hcacheaxi->InvalidateCompleteCallback = HAL_CACHEAXI_InvalidateCompleteCallback;
        break;

      case HAL_CACHEAXI_ERROR_CB_ID :
        /* Legacy weak ErrorCallback */
        hcacheaxi->ErrorCallback = HAL_CACHEAXI_ErrorCallback;
        break;

      case HAL_CACHEAXI_MSPINIT_CB_ID :
        /* Legacy weak MspInit */
        hcacheaxi->MspInitCallback = HAL_CACHEAXI_MspInit;
        break;

      case HAL_CACHEAXI_MSPDEINIT_CB_ID :
        /* Legacy weak MspDeInit */
        hcacheaxi->MspDeInitCallback = HAL_CACHEAXI_MspDeInit;
        break;

      default :
        /* Update the error code */
        hcacheaxi->ErrorCode |= HAL_CACHEAXI_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  HAL_ERROR;
        break;
    }
  }
  else if (HAL_CACHEAXI_STATE_RESET == hcacheaxi->State)
  {
    switch (CallbackID)
    {
      case HAL_CACHEAXI_MSPINIT_CB_ID :
        /* Legacy weak MspInit */
        hcacheaxi->MspInitCallback = HAL_CACHEAXI_MspInit;
        break;

      case HAL_CACHEAXI_MSPDEINIT_CB_ID :
        /* Legacy weak MspDeInit */
        hcacheaxi->MspDeInitCallback = HAL_CACHEAXI_MspDeInit;
        break;

      default :
        /* Update the error code */
        hcacheaxi->ErrorCode |= HAL_CACHEAXI_ERROR_INVALID_CALLBACK;

        /* Return error status */
        status =  HAL_ERROR;
        break;
    }
  }
  else
  {
    /* Update the error code */
    hcacheaxi->ErrorCode |= HAL_CACHEAXI_ERROR_INVALID_CALLBACK;

    /* Return error status */
    status =  HAL_ERROR;
  }

  return status;
}

#endif  /* USE_HAL_CACHEAXI_REGISTER_CALLBACKS */

/**
  * @brief  Cache clean  command  by address callback.
  * @param  hcacheaxi Pointer to a CACHEAXI_HandleTypeDef structure that contains
  *                   the configuration information for the specified CACHEAXIx peripheral.
  * @retval None
  */
__weak void HAL_CACHEAXI_CleanByAddrCallback(CACHEAXI_HandleTypeDef *hcacheaxi)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hcacheaxi);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_CACHEAXI_CleanByAddrCallback() should be implemented in the user file
   */
}

/**
  * @brief  Cache clean and Invalidate command  by address callback.
  * @param  hcacheaxi Pointer to a CACHEAXI_HandleTypeDef structure that contains
  *                   the configuration information for the specified CACHEAXIx peripheral.
  * @retval None
  */
__weak void HAL_CACHEAXI_CleanAndInvalidateByAddrCallback(CACHEAXI_HandleTypeDef *hcacheaxi)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hcacheaxi);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_CACHEAXI_CleanAndInvalidateByAddrCallback() should be implemented in the user file
   */
}

/**
  * @brief  Cache full invalidation complete callback.
  * @param  hcacheaxi Pointer to a CACHEAXI_HandleTypeDef structure that contains
  *                   the configuration information for the specified CACHEAXIx peripheral.
  * @retval None
  */
__weak void HAL_CACHEAXI_InvalidateCompleteCallback(CACHEAXI_HandleTypeDef *hcacheaxi)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hcacheaxi);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_CACHEAXI_InvalidateCompleteCallback() should be implemented in the user file
   */
}

/**
  * @brief  Error callback.
  * @param  hcacheaxi Pointer to a CACHEAXI_HandleTypeDef structure that contains
  *                   the configuration information for the specified CACHEAXIx peripheral.
  * @retval None
  */
__weak void HAL_CACHEAXI_ErrorCallback(CACHEAXI_HandleTypeDef *hcacheaxi)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hcacheaxi);

  /* NOTE : This function should not be modified, when the callback is needed,
            the HAL_CACHEAXI_ErrorCallback() should be implemented in the user file
   */
}

/**
  * @}
  */

/** @addtogroup CACHEAXI_Exported_Functions_Group3
  *
@verbatim
 ===============================================================================
            #####          Peripheral State          #####
 ===============================================================================
    [..]
    This subsection permit to get in run-time the status of the peripheral
    and the data flow.

@endverbatim
  * @{
  */

/**
  * @brief  Return the CACHEAXI handle state.
  * @param  hcacheaxi Pointer to a CACHEAXI_HandleTypeDef structure that contains
  *                   the configuration information for the specified CACHEAXIx peripheral.
  * @retval HAL state
  */
HAL_CACHEAXI_StateTypeDef HAL_CACHEAXI_GetState(const CACHEAXI_HandleTypeDef *hcacheaxi)
{
  /* Return CACHEAXI handle state */
  return hcacheaxi->State;
}

/**
  * @brief  Return the CACHEAXI error code
  * @param  hcacheaxi pointer to a CACHEAXI_HandleTypeDef structure that contains
  *                   the configuration information for the specified CACHEAXI.
  * @retval CACHEAXI Error Code
  */
uint32_t HAL_CACHEAXI_GetError(const CACHEAXI_HandleTypeDef *hcacheaxi)
{
  /* Return CACHEAXI handle error code */
  return hcacheaxi->ErrorCode;
}

/**
  * @}
  */

/* Private functions -------------------------------------------------------------------------------------------------*/
/** @defgroup CACHEAXI_Private_Functions CACHEAXI Private Functions
  * @brief    CACHEAXI Private Functions
  * @{
  */

/**
  * @brief  Launch CACHEAXI command Clean, Invalidate or clean and invalidate by Addr.
  * @param  hcacheaxi Pointer to a CACHEAXI_HandleTypeDef structure that contains
  *                   the configuration information for the specified CACHEAXIx peripheral.
  * @param  Command command to be applied for the CACHEAXI
  *                       CACHEAXI_COMMAND_CLEAN, CACHEAXI_COMMAND_CLEAN_INVALIDATE
  * @param  pAddr Start address of region to be Cleaned, Invalidated or Cleaned and Invalidated.
  * @param  dSize Size of the region to be Cleaned, Invalidated or Cleaned and Invalidated (in bytes).
  * @param  mode mode to be applied for the CACHEAXI
  *                       CACHEAXI_IT_MODE, CACHEAXI_POLLING_MODE.
  * @retval HAL status
  */
static HAL_StatusTypeDef CACHEAXI_CommandByAddr(CACHEAXI_HandleTypeDef *hcacheaxi, uint32_t Command,
                                                const uint32_t *pAddr, uint32_t dSize, uint32_t mode)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t op_addr = (uint32_t)pAddr;
  uint32_t tickstart;

  /* Check no ongoing operation */
  if (READ_BIT(hcacheaxi->Instance->SR, (CACHEAXI_SR_BUSYF | CACHEAXI_SR_BUSYCMDF)) != 0U)
  {
    /* Return busy status */
    status =  HAL_BUSY;
  }
  else
  {
    /* Update the error code */
    hcacheaxi->ErrorCode = HAL_CACHEAXI_ERROR_NONE;

    /* Update the CACHEAXI handle State */
    hcacheaxi->State = HAL_CACHEAXI_STATE_READY;

    /* Make sure flags are reset */
    WRITE_REG(hcacheaxi->Instance->FCR, (CACHEAXI_FCR_CBSYENDF | CACHEAXI_FCR_CCMDENDF));

    /* Fill area start address */
    WRITE_REG(hcacheaxi->Instance->CMDRSADDRR, op_addr);

